"""Синтаксична помилка: немає такої операції з множинами.
"""
# print({'P', 'y', 't', 'h', 'o', 'n'} / {'P', 'y'})

"""Віднімання множин. Результат: множина {'P', 'y', 't', 'h'}
"""
print({'P', 'y', 't', 'h', 'o', 'n'} - {'o', 'n'})

"""Об’єднання множин. Результат: множина {0, 1, 2, 4}
"""
m = 3
print({m - 1, 0, m + 1} | {m - 2})

"""Перевірка належності елемента множині. Результат: True, тому що число 4
належить множині {1, 2, 3, 4}
"""
print(4 in {1, 2, 3, 4})

"""Перевірка належності елемента множині. Результат: False, тому що
множина {4} не належить множині {1, 2, 3, 4}
"""
print({4} in {1, 2, 3, 4})

"""Синтаксична помилка - непарні дужки
"""
# print({1, 2, {3, 4})
